Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/atdf/ATSAME70N20.atdf
      <value-group caption="" name="GMAC_ST2CW17__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW18__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW19__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW110__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW111__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW112__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW113__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW114__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW115__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW116__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW117__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW118__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW119__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW120__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW121__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
